#include <iostream>

using namespace std;

int ary[7][10]= {
                {1,2,3,4,5,6,7,8,9,10},
                {1,2,3,4,5,6,7,8,9,10},
                {1,2,3,4,5,6,7,8,9,10},
                {1,2,3,4,5,6,7,8,9,10},
                {1,2,3,4,5,6,7,8,9,10},
                {1,2,3,4,5,6,7,8,9,10},
                {1,2,3,4,5,6,7,8,9,10},
                };
int fl,pl;
int yet=-1;


void schema()
{
cout<<"~~Таблица мест паркинга (0 - место забронировано)~~\n\n";
    for (int i=0;i<7;i++)
    {
        cout<<i+1<<"-й этаж: ";
        for (int j=0;j<10;j++)
        {
            cout<<" "<<ary[i][j]<<" |";
        }
        cout<<endl<<"--------------------------------------------------"<<endl;
    }
}

void RrtInPut()
{





bool fl_t=false, pl_t=false;

    while (!fl_t)
    {
        cout<<"Введите номер этажа: ";
        cin>>fl;
        --fl;
        if (fl>8 || fl<0)
        cout<<"Такого этажа нет! выберите этаж от 1 до 7!\n";
        else fl_t=true;
    }










    while (!pl_t)
    {
        cout<<"Введите номер места парковки: ";
        cin>>pl; --pl;
        if (pl>11 || pl<0) cout<<"Такого номера нет! выберите место от 1 до 10!\n";
        else pl_t=true;
    }


    if(ary[fl][pl]==0)
        {
            cout<<"Место занято! выберите другое!\n\n";
            schema();
        }
    else
        {
            ary[fl][pl]=0;
            cout<<"\n\n";
            cout<<"Бронирование прошло успешно!\n"<<"Ваше место парковки: "<<++fl<<"-й этаж, "<<++pl<<"-е место!\n";
        }
cout<<"Забронировать еще - нажмите 1. Выйти - лбюбая цифра: ";
cin>>yet;
cout<<endl;
    if (yet==1) RrtInPut();

}


int main()
{
setlocale(LC_ALL, "Russian");

    schema();
    cout<<"Чтобы забронмровать место в паркинге, выберите этаж и место.\n";
    RrtInPut();

return 0;
}
